app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)
    @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-06 00:49:07.521232"], ["description", "Here we go!"], ["updated_at", "2015-05-06 00:49:07.521232"], ["user_id", 1]]

  def update
    @pin.update(pin_params)
---
UPDATE "pins" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = 6  [["image_file_name", "AniME-Ryan.jpg"], ["image_updated_at", "2015-05-06 21:34:53.623477"], ["updated_at", "2015-05-06 21:34:53.792184"]]